Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotPasteInSketch Property
 Can't paste elements into sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPasteInSketch { get; }
Visual Basic
Public Shared ReadOnly Property CannotPasteInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPasteInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace